# IsAutoGenerated Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
AnalyticalLink..::..IsAutoGenerated Method
AnalyticalLink Class See Also
---
Specifies whether or not an AnalyticalLink was created by an Analytical Element.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public bool IsAutoGenerated()
```

Visual Basic
---
```text
Public Function IsAutoGenerated As Boolean
```

Visual C++
---
```text
public:
bool IsAutoGenerated()
```

# ### Return Value
True if AnalyticalLink was created by an Analytical Element, false otherwise.
# See Also
AnalyticalLink Class
Autodesk.Revit.DB.Structure Namespace